src/borwall-ex1-densityBasedOnAlpha/testCases/borwall-ex1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    object U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 1 -1 0 0 0 0];

internalField uniform (0 0 0);

boundaryField
{
    inlet
    {
        type codedFixedValue;
        name parabolicInlet;

        code
        #{
            vectorField faceCenters(this->patch().Cf());
            vectorField inletVal(faceCenters.size(), Zero);

            forAll(inletVal, faceI)
            {
                scalar yi = faceCenters[faceI].y();

                inletVal[faceI].x() = 0.1*4*yi*(1-yi);
            }
            operator==(inletVal);
        #};
        value $internalField;
    }

    outlet
    {
        type            zeroGradient;
        //type inletOutlet;
        //inletValue uniform(0 0 0);
    }

    upperWall
    {
        type noSlip;
    }

    lowerWall
    {
        type noSlip;
    }

    frontAndBack
    {
        type empty;
    }
}

// ************************************************************************* //
